# Import and Export : MySQL - Python

## MySQL - Import

In [17]:
#pip install pymysql
#!pip install mysqlclient

In [3]:
#libraries
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import os

In [4]:
print(pymysql.__version__)

1.4.6

In [5]:
F1 = '/Users/du/dup/analytics/data/'
print(sorted(os.listdir(F1)))

['.DS_Store', 'Country_Codes_and_Names.xlsx', 'HRDataset_v14.csv', 'MFGEmployees4.csv', 'Real_Estate_Sales_2001-2023_GL.csv', 'VLOOKUP and HLOOKUP.xlsx', 'WA_Fn-UseC_-HR-Employee-Attrition.csv', 'archive.zip', 'attrition.zip', 'attritionData.csv', 'dataset_2025-08-16T11_40_29.251665198Z_DEFAULT_INTEGRATION_IMF.STA_QGDP_WCA_3.0.0.csv', 'deceptive-opinion.csv', 'hrClustering.csv', 'hrdataset.zip', 'mtcars.csv', 'pdftable.pdf', 'sales_forecasting_data.xlsx', 'stateCodes.csv', 'students1.csv', 'studentsX1.csv', 'studentsX2.xlsx', 'students_export.csv', 'subjectARdata.csv']

In [6]:
folder1 = '/Users/du/dup/analytics/data/'
file1 = "students1.csv"

# Join folder and file name
file_path = os.path.join(folder1, file1)

if os.path.isfile(file_path):
    print(f"✅ File exists: {file_path}")
else:
    print(f"❌ File not found in {folder_path}")

✅ File exists: /Users/du/dup/analytics/data/students1.csv

In [7]:
print(file_path)

/Users/du/dup/analytics/data/students1.csv

In [8]:
df = pd.read_csv(file_path)
df.shape

(30, 6)

In [9]:
df.head()

,id,name,branch,score,exam_date,remarks
0,1,Rick Johnson,Mechanical,63.68,2025-03-30,Average
1,2,Shannon Hall,Electrical,74.35,2024-03-28,Outstanding
2,3,Stephanie Flores,Computer Science,88.97,2024-05-17,Average
3,4,Keith Ferrell,Civil,75.00,2025-06-22,Average
4,5,Corey Allen,Computer Science,63.14,2025-05-17,Needs Improvement

In [10]:
df.dtypes  # dates type NA

id             int64
name          object
branch        object
score        float64
exam_date     object
remarks       object
dtype: object

In [11]:
df['exam_date'] = pd. to_datetime(df['exam_date'], dayfirst=False, errors='coerce')
df.dtypes

id                    int64
name                 object
branch               object
score               float64
exam_date    datetime64[ns]
remarks              object
dtype: object

In [12]:
#user-piuser, pwd-Pass#123, yourdb - students
#engine = create_engine('mysql+pymysql://piuser:Pass#123@localhost:3306/piit')
engine1 = create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit")
engine1

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [13]:
conn = engine1.connect()
print(conn)

<sqlalchemy.engine.base.Connection object at 0x14fc6c170>

In [14]:
pd.read_sql('SHOW DATABASES;', engine1)

             Database
0          GSTBILLING
1  information_schema
2               mysql
3  performance_schema
4                piit
5                 sys

In [15]:
pd.read_sql('SHOW TABLES;', engine1)

       Tables_in_piit
0           employees
1         math_scores
2               sales
3      student_scores
4      student_totals
5            students
6  subject_avg_scores

In [16]:
df.to_sql('students', engine1, if_exists='append', index=False, chunksize=1000, method='multi')

30

In [17]:
 # Students from csv imported in mysql database as students table

## Export from MySQL to csv/excel

In [18]:
# libraries
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import os

In [19]:
# Engine - piuser#123
engine1 = create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit")
engine1

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [44]:
df2 = pd.read_sql("SELECT * FROM employees", engine1)
df2.shape

(5, 5)

In [45]:
df2.head(2)

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0

In [46]:
csvfile = '/Users/du/dup/analytics/data/employees1.csv'
xlsfile =  '/Users/du/dup/analytics/data/employees2.xlsx'

In [47]:
print(os.listdir('/Users/du/dup/analytics/data'))

['studentsX1.csv', 'MFGEmployees4.csv', '.DS_Store', 'employees2.xlsx', 'students1.csv', 'pdftable.pdf', 'dataset_2025-08-16T11_40_29.251665198Z_DEFAULT_INTEGRATION_IMF.STA_QGDP_WCA_3.0.0.csv', 'attritionData.csv', 'WA_Fn-UseC_-HR-Employee-Attrition.csv', 'employees1.csv', 'sales_forecasting_data.xlsx', 'hrClustering.csv', 'stateCodes.csv', 'Country_Codes_and_Names.xlsx', 'studentsX2.xlsx', 'mtcars.csv', 'VLOOKUP and HLOOKUP.xlsx', 'archive.zip', 'attrition.zip', 'students_export.csv', 'HRDataset_v14.csv', 'hrdataset.zip', 'Real_Estate_Sales_2001-2023_GL.csv', 'deceptive-opinion.csv', 'subjectARdata.csv']

In [48]:
df2.to_csv(csvfile, index=False)

In [49]:
df2.to_excel(xlsfile, index=False)

In [50]:
print(sorted(os.listdir('/Users/du/dup/analytics/data'), key=str.lower))

['.DS_Store', 'archive.zip', 'attrition.zip', 'attritionData.csv', 'Country_Codes_and_Names.xlsx', 'dataset_2025-08-16T11_40_29.251665198Z_DEFAULT_INTEGRATION_IMF.STA_QGDP_WCA_3.0.0.csv', 'deceptive-opinion.csv', 'employees1.csv', 'employees2.xlsx', 'hrClustering.csv', 'hrdataset.zip', 'HRDataset_v14.csv', 'MFGEmployees4.csv', 'mtcars.csv', 'pdftable.pdf', 'Real_Estate_Sales_2001-2023_GL.csv', 'sales_forecasting_data.xlsx', 'stateCodes.csv', 'students1.csv', 'students_export.csv', 'studentsX1.csv', 'studentsX2.xlsx', 'subjectARdata.csv', 'VLOOKUP and HLOOKUP.xlsx', 'WA_Fn-UseC_-HR-Employee-Attrition.csv']

In [51]:
# import data and check
df2b = pd.read_csv(csvfile)
df2b.shape

(5, 5)

In [52]:
df2c = pd.read_excel(xlsfile)
df2c.shape

(5, 5)

In [53]:
# select any df
df2b

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0

In [55]:
df4 = df2b.copy()
df4

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0

In [56]:
df4['employee_id'] = df4['employee_id'] +100

In [57]:
df4

   employee_id first_name last_name department   salary
0          101       John       Doe         HR  50000.0
1          102       Jane     Smith         IT  60000.0
2          103      Alice   Johnson    Finance  55000.0
3          104        Bob  Williams         IT  62000.0
4          105      Emily     Brown         HR  48000.0

In [35]:
# Write from CSV to MYSQL

In [58]:
df4.to_sql(  name='employees',    con=engine1,   if_exists='append',   # options: 'fail', 'replace', 'append'
    index=False )

5

In [59]:
df5 = pd.read_sql("SELECT * FROM employees", engine1)
df5

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0
5          101       John       Doe         HR  50000.0
6          102       Jane     Smith         IT  60000.0
7          103      Alice   Johnson    Finance  55000.0
8          104        Bob  Williams         IT  62000.0
9          105      Emily     Brown         HR  48000.0

In [ ]:
#Done